-- =============================================================================
-- MODULE: MONITORS & DISPLAYS
-- =============================================================================
-- Монитор Huawei SSN-24 (1080p @ 74.97Hz для ультра-плавности)
hl.monitor({
    output   = "DP-1",
    mode     = "1920x1080@74.97",
    position = "0x0",
    scale    = 1,
})

-- Фоллбек для любого нового подключенного монитора
hl.monitor({
    output   = "",
    mode     = "preferred",
    position = "auto",
    scale    = "auto",
})
